In [1]:
import pandas as pd #use pandas property 
import numpy as np #use to numpy 
import matplotlib.pyplot as plt #use to create or plot graph
from scipy import stats #use to mode and z_scores

In [30]:
df = pd.read_csv("retail_store_sales.csv")

In [31]:
df.head()

,Transaction ID,Customer ID,Category,Item,Price Per Unit,Quantity,Total Spent,Payment Method,Location,Transaction Date,Discount Applied
0,TXN_6867343,CUST_09,Patisserie,Item_10_PAT,18.5,10.0,185.0,Digital Wallet,Online,2024-04-08,True
1,TXN_3731986,CUST_22,Milk Products,Item_17_MILK,29.0,9.0,261.0,Digital Wallet,Online,2023-07-23,True
2,TXN_9303719,CUST_02,Butchers,Item_12_BUT,21.5,2.0,43.0,Credit Card,Online,2022-10-05,False
3,TXN_9458126,CUST_06,Beverages,Item_16_BEV,27.5,9.0,247.5,Credit Card,Online,2022-05-07,NaN
4,TXN_4575373,CUST_05,Food,Item_6_FOOD,12.5,7.0,87.5,Digital Wallet,Online,2022-10-02,False

In [32]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 12575 entries, 0 to 12574
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    12575 non-null  str
 1   Customer ID       12575 non-null  str
 2   Category          12575 non-null  str
 3   Item              11362 non-null  str
 4   Price Per Unit    11966 non-null  float64
 5   Quantity          11971 non-null  float64
 6   Total Spent       11971 non-null  float64
 7   Payment Method    12575 non-null  str
 8   Location          12575 non-null  str
 9   Transaction Date  12575 non-null  str
 10  Discount Applied  8376 non-null   object
dtypes: float64(3), object(1), str(7)
memory usage: 1.1+ MB

In [33]:
df.isna().sum()

Transaction ID         0
Customer ID            0
Category               0
Item                1213
Price Per Unit       609
Quantity             604
Total Spent          604
Payment Method         0
Location               0
Transaction Date       0
Discount Applied    4199
dtype: int64

In [6]:
# df.dropna(inplace=True)

In [7]:
df.info()

<class 'pandas.DataFrame'>
Index: 7579 entries, 0 to 12573
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    7579 non-null   str
 1   Customer ID       7579 non-null   str
 2   Category          7579 non-null   str
 3   Item              7579 non-null   str
 4   Price Per Unit    7579 non-null   float64
 5   Quantity          7579 non-null   float64
 6   Total Spent       7579 non-null   float64
 7   Payment Method    7579 non-null   str
 8   Location          7579 non-null   str
 9   Transaction Date  7579 non-null   str
 10  Discount Applied  7579 non-null   object
dtypes: float64(3), object(1), str(7)
memory usage: 710.5+ KB

In [34]:
df.isnull().shape

(12575, 11)

In [35]:
df["Transaction ID"].duplicated().sum()

np.int64(0)

In [36]:
df["Customer ID"].value_counts()

Customer ID
CUST_05    544
CUST_24    543
CUST_13    534
CUST_08    533
CUST_09    519
CUST_15    519
CUST_16    515
CUST_23    513
CUST_01    507
CUST_18    507
CUST_20    507
CUST_11    503
CUST_22    501
CUST_10    501
CUST_21    498
CUST_12    498
CUST_07    491
CUST_02    488
CUST_17    487
CUST_19    487
CUST_14    484
CUST_06    481
CUST_25    476
CUST_04    474
CUST_03    465
Name: count, dtype: int64

In [38]:
 df["Discount Applied"]= df["Discount Applied"].fillna(df["Discount Applied"].mode()[0])

In [39]:
df["Discount Applied"].value_counts()

Discount Applied
True     8418
False    4157
Name: count, dtype: int64

In [40]:
df.isna().sum()

Transaction ID         0
Customer ID            0
Category               0
Item                1213
Price Per Unit       609
Quantity             604
Total Spent          604
Payment Method         0
Location               0
Transaction Date       0
Discount Applied       0
dtype: int64

In [42]:
 df["Item"]= df["Item"].fillna(df["Item"].mode()[0])

In [46]:
df.isna().sum()

Transaction ID        0
Customer ID           0
Category              0
Item                  0
Price Per Unit      609
Quantity            604
Total Spent         604
Payment Method        0
Location              0
Transaction Date      0
Discount Applied      0
dtype: int64

In [53]:
df[["Price Per Unit", "Quantity", "Total Spent"]]=df[["Price Per Unit", "Quantity", "Total Spent"]].fillna(df[["Price Per Unit", "Quantity", "Total Spent"]].mean())

In [54]:
df.isna().sum()

Transaction ID      0
Customer ID         0
Category            0
Item                0
Price Per Unit      0
Quantity            0
Total Spent         0
Payment Method      0
Location            0
Transaction Date    0
Discount Applied    0
dtype: int64

In [56]:
df["Transaction Date"]=pd.to_datetime(df["Transaction Date"])

In [55]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 12575 entries, 0 to 12574
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    12575 non-null  str
 1   Customer ID       12575 non-null  str
 2   Category          12575 non-null  str
 3   Item              12575 non-null  str
 4   Price Per Unit    12575 non-null  float64
 5   Quantity          12575 non-null  float64
 6   Total Spent       12575 non-null  float64
 7   Payment Method    12575 non-null  str
 8   Location          12575 non-null  str
 9   Transaction Date  12575 non-null  datetime64[us]
 10  Discount Applied  12575 non-null  object
dtypes: datetime64[us](1), float64(3), object(1), str(6)
memory usage: 1.1+ MB

In [57]:
df.head()

,Transaction ID,Customer ID,Category,Item,Price Per Unit,Quantity,Total Spent,Payment Method,Location,Transaction Date,Discount Applied
0,TXN_6867343,CUST_09,Patisserie,Item_10_PAT,18.5,10.0,185.0,Digital Wallet,Online,2024-04-08,True
1,TXN_3731986,CUST_22,Milk Products,Item_17_MILK,29.0,9.0,261.0,Digital Wallet,Online,2023-07-23,True
2,TXN_9303719,CUST_02,Butchers,Item_12_BUT,21.5,2.0,43.0,Credit Card,Online,2022-10-05,False
3,TXN_9458126,CUST_06,Beverages,Item_16_BEV,27.5,9.0,247.5,Credit Card,Online,2022-05-07,True
4,TXN_4575373,CUST_05,Food,Item_6_FOOD,12.5,7.0,87.5,Digital Wallet,Online,2022-10-02,False

In [58]:
#Top Selling Items
df.groupby("Item")["Quantity"].sum().sort_values(ascending=False).head(5)

Item
Item_2_BEV      7406.973269
Item_16_MILK     627.000000
Item_25_FUR      616.000000
Item_19_MILK     589.000000
Item_5_FUR       581.000000
Name: Quantity, dtype: float64

In [59]:
#Highest Revenue Items 
df.groupby("Item")["Total Spent"].sum().sort_values(ascending=False).head(5)

Item
Item_2_BEV     161776.656545
Item_25_FUR     25256.000000
Item_25_EHE     23083.000000
Item_25_BUT     21894.000000
Item_24_FUR     21172.000000
Name: Total Spent, dtype: float64

In [60]:
#Total Sales 
df["Transaction ID"].nunique()

12575

In [62]:
# Discount Applied Analysis
# Discount vs No Discount Revenue
df.groupby("Discount Applied")["Total Spent"].sum()

Discount Applied
False    5.401579e+05
True     1.090223e+06
Name: Total Spent, dtype: float64

In [63]:
# Discount par average bill
df.groupby("Discount Applied")["Total Spent"].mean()

Discount Applied
False    129.939367
True     129.510954
Name: Total Spent, dtype: float64

In [64]:
#Location-wise Sales
df.groupby("Location")["Total Spent"].sum().sort_values(ascending=False)

Location
Online      828481.637040
In-store    801899.519505
Name: Total Spent, dtype: float64

In [65]:
df.shape

(12575, 11)